docs/book-notes/EOPL/LET/LET.org
#+html_head: <link rel="stylesheet" href="../../../css/org-page.css"/>
#+property: tangle LET.jo
#+title: LET

* intro

  - We begin by specifying a very simple language,
    which we call LET, after its most interesting feature.

* specifying the expression

  - In this language,
    a program is just an expression.

  - An expression is either
    1. an integer constant,
    2. a difference expression,
    3. a zero-test expression,
    4. a conditional expression,
    5. a variable, or a let expression.

  - example expression :
    (diff 55 (diff x 11))

  #+begin_src jojo
  (note program = exp)
  (note exp
    = <const-exp>
    | <zero?-exp>
    | <if-exp>
    | <diff-exp>
    | <var-exp>
    | <let-exp>)
  #+end_src

* specification of values

  - An important part of the specification
    of any programming language
    is the set of values that the language manipulates.

  - Each language has at least two such sets :
    1. the expressed values
       which are the possible values of expressions,
    2. the denoted values
       which are the values bound to variables.

  - In the languages of this chapter,
    the expressed and denoted values will always be the same.
    They will start out as :
    - ExpVal = Int + Bool
    - DenVal = Int + Bool

  #+begin_src jojo
  (note expval
    = <num-val>
    | <bool-val>)

  (+data <num-val>  .num)
  (+data <bool-val> .bool)
  #+end_src

* environments

  - If we are going to evaluate expressions containing variables,
    we will need to know the value associated with each variable.

    We do this by keeping those values in an environment.

  - An environment is a function
    whose domain is a finite set of variables
    and whose range is the denoted values.

  #+begin_src jojo
  (note env = <null-env> | <cons-env>)

  (+data <null-env>)
  (+data <cons-env> .rest .var .val)

  (+jojo env-apply (-> :var :env -- expval)
    (case :env
      <null-env> ["- env-apply fail" p nl
                  "  can not find var : " p :var p nl
                  error]
      <cons-env> (if [:env .var :var equal?]
                     [:env .val]
                     [:var :env .rest env-apply])))
  #+end_src

* specifying expressions

  #+begin_src jojo
  (+data <const-exp> .num)
  (+data <zero?-exp> .exp1)
  (+data <if-exp>    .exp1 .exp2 .exp3)
  (+data <diff-exp>  .exp1 .exp2)
  (+data <var-exp>   .var)
  (+data <let-exp>   .var .exp1 .body)

  (note
    (= :n const-exp :env eval, :n num-val)
    (= :var var-exp :env eval, :var :env env-apply)
    (= :exp1 :exp2 diff-exp :env eval,
       :exp1 :env eval .num
       :exp2 :env eval .num sub num-val))
  #+end_src

