docs/book-notes/EOPL/LET/LET.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-15 Sun 17:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LET</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="xieyuheng" />
<link rel="stylesheet" href="../../../css/org-page.css"/>
</head>
<body>
<div id="content">
<h1 class="title">LET</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9b80f42">intro</a></li>
<li><a href="#orgf3ed0fb">specifying the expression</a></li>
<li><a href="#orgedde980">specification of values</a></li>
<li><a href="#org835d2f">environments</a></li>
<li><a href="#org483c7b1">specifying expressions</a></li>
<li><a href="#orgc446166">specifying programs</a></li>
<li><a href="#org22fce8a">specifying conditionals</a></li>
<li><a href="#org3bc0fc0">specifying let</a></li>
<li><a href="#org3ea5a88">eval</a></li>
<li><a href="#org49cde3c">parse</a></li>
<li><a href="#org25f3edf">interface</a></li>
<li><a href="#org3cd9f8f"><span class="done _test_">[test]</span> </a></li>
</ul>
</div>
</div>

<div id="outline-container-org9b80f42" class="outline-2">
<h2 id="org9b80f42">intro</h2>
<div class="outline-text-2" id="text-org9b80f42">
<ul class="org-ul">
<li><p>We begin by specifying a very simple language,</p><p>which we call LET, after its most interesting feature.</p></li></ul>
</div>
</div>

<div id="outline-container-orgf3ed0fb" class="outline-2">
<h2 id="orgf3ed0fb">specifying the expression</h2>
<div class="outline-text-2" id="text-orgf3ed0fb">
<ul class="org-ul">
<li><p>In this language,</p><p>a program is just an expression.</p></li>

<li><p>An expression is either</p><p><ol class="org-ol"></p><p><li>an integer constant,</li></p><p><li>a difference expression,</li></p><p><li>a zero-test expression,</li></p><p><li>a conditional expression,</li></p><p><li>a variable, or a let expression.</li></ol></p></li>

<li><p>example expression :</p><p>(diff 55 (diff x 11))</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> program = exp<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> exp
  = <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;var-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp&gt;</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgedde980" class="outline-2">
<h2 id="orgedde980">specification of values</h2>
<div class="outline-text-2" id="text-orgedde980">
<ul class="org-ul">
<li><p>An important part of the specification</p><p>of any programming language</p><p>is the set of values that the language manipulates.</p></li>

<li><p>Each language has at least two such sets :</p><p><ol class="org-ol"></p><p><li>the expressed values</p><p>which are the possible values of expressions,</li></p><p><li>the denoted values</p><p>which are the values bound to variables.</li></ol></p></li>

<li><p>In the languages of this chapter,</p><p>the expressed and denoted values will always be the same.</p><p>They will start out as :</p><p><ul class="org-ul"></p><p><li><p>ExpVal = Int + Bool</p></li></p><p><li><p>DenVal = Int + Bool</p></li></ul></p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> expval
  = <span style="color: #66d9ef; font-weight: bold;">&lt;num-val&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;bool-val&gt;</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;num-val&gt;</span>  .num<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;bool-val&gt;</span> <span style="color: #ae81ff;">.bool</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org835d2f" class="outline-2">
<h2 id="org835d2f">environments</h2>
<div class="outline-text-2" id="text-org835d2f">
<ul class="org-ul">
<li><p><p></p><p>If we are going to evaluate expressions containing variables,</p><p>we will need to know the value associated with each variable.</p><p></p></p><p></p><p><p></p><p>We do this by keeping those values in an environment.</p><p></p></p></li>

<li><p>An environment is a function</p><p>whose domain is a finite set of variables</p><p>and whose range is the denoted values.</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> env = <span style="color: #66d9ef; font-weight: bold;">&lt;null-env&gt;</span> | <span style="color: #66d9ef; font-weight: bold;">&lt;cons-env&gt;</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;null-env&gt;</span><span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;cons-env&gt;</span> <span style="color: #ae81ff;">.rest</span> <span style="color: #ae81ff;">.var</span> .val<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> env-apply <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:env</span> <span style="color: #66d9ef; font-weight: bold;">--</span> expval<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:env</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;null-env&gt;</span> <span style="color: #797979;">[</span><span style="color: #e6db74;">"- env-apply fail"</span> p nl
                <span style="color: #e6db74;">"  can not find var : "</span> p <span style="color: #a6e22e;">:var</span> p nl
                <span style="color: #f92672; font-weight: bold;">error</span><span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;cons-env&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:env</span> <span style="color: #ae81ff;">.var</span> <span style="color: #a6e22e;">:var</span> equal?<span style="color: #797979;">]</span>
                   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:env</span> <span style="color: #ae81ff;">.val</span><span style="color: #797979;">]</span>
                   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:env</span> <span style="color: #ae81ff;">.rest</span> env-apply<span style="color: #797979;">]</span><span style="color: #696969;">)))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org483c7b1" class="outline-2">
<h2 id="org483c7b1">specifying expressions</h2>
<div class="outline-text-2" id="text-org483c7b1">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span> .num<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span> .exp1<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>    <span style="color: #ae81ff;">.exp1</span> <span style="color: #ae81ff;">.exp2</span> .exp3<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>  <span style="color: #ae81ff;">.exp1</span> .exp2<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;var-exp&gt;</span>   .var<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp&gt;</span>   <span style="color: #ae81ff;">.var</span> <span style="color: #ae81ff;">.exp1</span> .body<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:n</span> const-exp <span style="color: #a6e22e;">:env</span> eval<span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:n</span> num-val<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:var</span> var-exp <span style="color: #a6e22e;">:env</span> eval<span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:env</span> env-apply<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:exp1</span> <span style="color: #a6e22e;">:exp2</span> diff-exp <span style="color: #a6e22e;">:env</span> eval<span style="color: #f92672; font-weight: bold;">,</span>
     <span style="color: #a6e22e;">:exp1</span> <span style="color: #a6e22e;">:env</span> eval <span style="color: #ae81ff;">.num</span>
     <span style="color: #a6e22e;">:exp2</span> <span style="color: #a6e22e;">:env</span> eval <span style="color: #ae81ff;">.num</span> sub num-val<span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
