docs/book-notes/EOPL/LET/LET.org
* specifying programs

  - In our language,
    a whole program is just an expression.
    In order to find the value of such an expression,
    we need to specify the values
    of the free variables in the program.

  - So the value of a program
    is just the value of that expression
    in a suitable initial environment.

  - We choose our initial environment to be [i=1,v=5,x=10].

  #+begin_src jojo
  (+jojo init-env
    null-env
    ':x 10 num-val cons-env
    ':v 5  num-val cons-env
    ':i 1  num-val cons-env)

  (+jojo program-eval (-> :program -- expval)
    :program init-env eval)
  #+end_src

* specifying conditionals

  - The next portion of the language
    introduces an interface for booleans in our language.

  - The language has one constructor of booleans -- 'zero?',
    and one observer of booleans -- the if expression.

  #+begin_src jojo
  (note
    (= :exp1 :env eval, :val1)
    ------------------------------------
    (= :exp1 zero?-exp :env eval
       (if [:val1 .num 0 eq?]
         [true  bool-val]
         [false bool-val])))
  #+end_src

  - An if expression is an observer of boolean values.

  #+begin_src jojo
  (note
    (= :exp1 :env eval, :val1)
    ------------------------------------
    (= :exp1 :exp2 :exp3 if-exp :env eval
       (if [:val1 .bool]
         [:exp2 :env eval]
         [:exp3 :env eval])))
  #+end_src

  - Rules of inference like this
    make the intended behavior
    of any individual expression easy to specify,
    but they are not very good
    for displaying a deduction.
    Because deduction by inference rules
    will generate a tree.

  - we can rewrite the rules as equations.
    We can then use substitution of equals for equals
    to display a calculation.

  #+begin_src jojo
  (note
    (= :exp1 :exp2 :exp3 if-exp :env eval
       (if [:exp1 :env eval .bool]
         [:exp2 :env eval]
         [:exp3 :env eval])))
  #+end_src

  - for example :

  #+begin_src jojo
  (note

    null-env ':x 33 cons-env ':y 22 cons-env :env!

    (=
     '(if (zero? (diff :x 11))
        (diff :y 2)
        (diff :y 4))
     parse :env eval

     (if ['(zero? (diff :x 11)) parse :env eval .bool]
       ['(diff :y 2) parse :env eval]
       ['(diff :y 4) parse :env eval])

     (if [false bool-val .bool]
       ['(diff :y 2) parse :env eval]
       ['(diff :y 4) parse :env eval])

     (if false
       ['(diff :y 2) parse :env eval]
       ['(diff :y 4) parse :env eval])

     '(diff :y 4) parse :env eval

     18 num-val))
  #+end_src

