docs/book-notes/EOPL/LET/LET.html

<div id="outline-container-orgc446166" class="outline-2">
<h2 id="orgc446166">specifying programs</h2>
<div class="outline-text-2" id="text-orgc446166">
<ul class="org-ul">
<li><p>In our language,</p><p>a whole program is just an expression.</p><p>In order to find the value of such an expression,</p><p>we need to specify the values</p><p>of the free variables in the program.</p></li>

<li><p>So the value of a program</p><p>is just the value of that expression</p><p>in a suitable initial environment.</p></li>

<li><p>We choose our initial environment to be [i=1,v=5,x=10].</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> init-env
  null-env
  '<span style="color: #a6e22e;">:x</span> <span style="color: #ae81ff;">10</span> num-val cons-env
  '<span style="color: #a6e22e;">:v</span> <span style="color: #ae81ff;">5</span>  num-val cons-env
  '<span style="color: #a6e22e;">:i</span> <span style="color: #ae81ff;">1</span>  num-val cons-env<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> program-eval <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:program</span> <span style="color: #66d9ef; font-weight: bold;">--</span> expval<span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:program</span> init-env eval<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org22fce8a" class="outline-2">
<h2 id="org22fce8a">specifying conditionals</h2>
<div class="outline-text-2" id="text-org22fce8a">
<ul class="org-ul">
<li><p>The next portion of the language</p><p>introduces an interface for booleans in our language.</p></li>

<li><p>The language has one constructor of booleans &#x2013; 'zero?',</p><p>and one observer of booleans &#x2013; the if expression.</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:exp1</span> <span style="color: #a6e22e;">:env</span> eval<span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:val1</span><span style="color: #696969;">)</span>
  ------------------------------------
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:exp1</span> zero?-exp <span style="color: #a6e22e;">:env</span> eval
     <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:val1</span> <span style="color: #ae81ff;">.num</span> <span style="color: #ae81ff;">0</span> eq?<span style="color: #797979;">]</span>
       <span style="color: #797979;">[</span><span style="color: #66d9ef; font-weight: bold;">true</span>  bool-val<span style="color: #797979;">]</span>
       <span style="color: #797979;">[</span><span style="color: #66d9ef; font-weight: bold;">false</span> bool-val<span style="color: #797979;">]</span><span style="color: #696969;">)))</span>
</pre>
</div>

<ul class="org-ul">
<li><p>An if expression is an observer of boolean values.</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:exp1</span> <span style="color: #a6e22e;">:env</span> eval<span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:val1</span><span style="color: #696969;">)</span>
  ------------------------------------
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:exp1</span> <span style="color: #a6e22e;">:exp2</span> <span style="color: #a6e22e;">:exp3</span> if-exp <span style="color: #a6e22e;">:env</span> eval
     <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:val1</span> <span style="color: #ae81ff;">.bool</span><span style="color: #797979;">]</span>
       <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp2</span> <span style="color: #a6e22e;">:env</span> eval<span style="color: #797979;">]</span>
       <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp3</span> <span style="color: #a6e22e;">:env</span> eval<span style="color: #797979;">]</span><span style="color: #696969;">)))</span>
</pre>
</div>

<ul class="org-ul">
<li><p>Rules of inference like this</p><p>make the intended behavior</p><p>of any individual expression easy to specify,</p><p>but they are not very good</p><p>for displaying a deduction.</p><p>Because deduction by inference rules</p><p>will generate a tree.</p></li>

<li><p>we can rewrite the rules as equations.</p><p>We can then use substitution of equals for equals</p><p>to display a calculation.</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:exp1</span> <span style="color: #a6e22e;">:exp2</span> <span style="color: #a6e22e;">:exp3</span> if-exp <span style="color: #a6e22e;">:env</span> eval
     <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp1</span> <span style="color: #a6e22e;">:env</span> eval <span style="color: #ae81ff;">.bool</span><span style="color: #797979;">]</span>
       <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp2</span> <span style="color: #a6e22e;">:env</span> eval<span style="color: #797979;">]</span>
       <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp3</span> <span style="color: #a6e22e;">:env</span> eval<span style="color: #797979;">]</span><span style="color: #696969;">)))</span>
</pre>
</div>

<ul class="org-ul">
<li><p>for example :</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>

  null-env '<span style="color: #a6e22e;">:x</span> <span style="color: #ae81ff;">33</span> cons-env '<span style="color: #a6e22e;">:y</span> <span style="color: #ae81ff;">22</span> cons-env <span style="color: #fd971f;">:env!</span>

  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span>
   '<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #696969;">(</span>zero? <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #a6e22e;">:x</span> <span style="color: #ae81ff;">11</span><span style="color: #696969;">))</span>
      <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #a6e22e;">:y</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #a6e22e;">:y</span> <span style="color: #ae81ff;">4</span><span style="color: #696969;">))</span>
   parse <span style="color: #a6e22e;">:env</span> eval

   <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #797979;">[</span>'<span style="color: #696969;">(</span>zero? <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #a6e22e;">:x</span> <span style="color: #ae81ff;">11</span><span style="color: #696969;">))</span> parse <span style="color: #a6e22e;">:env</span> eval <span style="color: #ae81ff;">.bool</span><span style="color: #797979;">]</span>
     <span style="color: #797979;">[</span>'<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #a6e22e;">:y</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span> parse <span style="color: #a6e22e;">:env</span> eval<span style="color: #797979;">]</span>
     <span style="color: #797979;">[</span>'<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #a6e22e;">:y</span> <span style="color: #ae81ff;">4</span><span style="color: #696969;">)</span> parse <span style="color: #a6e22e;">:env</span> eval<span style="color: #797979;">]</span><span style="color: #696969;">)</span>

   <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #797979;">[</span><span style="color: #66d9ef; font-weight: bold;">false</span> bool-val <span style="color: #ae81ff;">.bool</span><span style="color: #797979;">]</span>
     <span style="color: #797979;">[</span>'<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #a6e22e;">:y</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span> parse <span style="color: #a6e22e;">:env</span> eval<span style="color: #797979;">]</span>
     <span style="color: #797979;">[</span>'<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #a6e22e;">:y</span> <span style="color: #ae81ff;">4</span><span style="color: #696969;">)</span> parse <span style="color: #a6e22e;">:env</span> eval<span style="color: #797979;">]</span><span style="color: #696969;">)</span>

   <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #66d9ef; font-weight: bold;">false</span>
     <span style="color: #797979;">[</span>'<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #a6e22e;">:y</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span> parse <span style="color: #a6e22e;">:env</span> eval<span style="color: #797979;">]</span>
     <span style="color: #797979;">[</span>'<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #a6e22e;">:y</span> <span style="color: #ae81ff;">4</span><span style="color: #696969;">)</span> parse <span style="color: #a6e22e;">:env</span> eval<span style="color: #797979;">]</span><span style="color: #696969;">)</span>

   '<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #a6e22e;">:y</span> <span style="color: #ae81ff;">4</span><span style="color: #696969;">)</span> parse <span style="color: #a6e22e;">:env</span> eval

   <span style="color: #ae81ff;">18</span> num-val<span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
