docs/book-notes/EOPL/LET/LET.html

<div id="outline-container-org3bc0fc0" class="outline-2">
<h2 id="org3bc0fc0">specifying let</h2>
<div class="outline-text-2" id="text-org3bc0fc0">
<ul class="org-ul">
<li><p>Next we address the problem of</p><p>creating new variable bindings with a let expression.</p></li>

<li><p>reference rule :</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:exp1</span> <span style="color: #a6e22e;">:env</span> eval<span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:val1</span><span style="color: #696969;">)</span>
  ------------------------------------
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:exp1</span> <span style="color: #a6e22e;">:body</span> <span style="color: #a6e22e;">:env</span> eval<span style="color: #f92672; font-weight: bold;">,</span>
     <span style="color: #a6e22e;">:body</span> <span style="color: #a6e22e;">:env</span> <span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:val1</span> cons-env eval<span style="color: #696969;">))</span>
</pre>
</div>

<ul class="org-ul">
<li><p>equation :</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">=</span> <span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:exp1</span> <span style="color: #a6e22e;">:body</span> <span style="color: #a6e22e;">:env</span> eval<span style="color: #f92672; font-weight: bold;">,</span>
   <span style="color: #a6e22e;">:env</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:var</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:exp1</span> <span style="color: #a6e22e;">:env</span> eval<span style="color: #f92672; font-weight: bold;">,</span> cons-env
   <span style="color: #a6e22e;">:body</span> swap eval<span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ea5a88" class="outline-2">
<h2 id="org3ea5a88">eval</h2>
<div class="outline-text-2" id="text-org3ea5a88">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> eval <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:exp</span> <span style="color: #a6e22e;">:env</span> <span style="color: #66d9ef; font-weight: bold;">--</span> expval<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:exp</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.num</span>  num-val<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:env</span> eval <span style="color: #ae81ff;">.num</span> <span style="color: #ae81ff;">0</span> equal? bool-val<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:env</span> eval <span style="color: #ae81ff;">.bool</span><span style="color: #797979;">]</span>
                    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp2</span> <span style="color: #a6e22e;">:env</span> eval<span style="color: #797979;">]</span>
                    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp3</span> <span style="color: #a6e22e;">:env</span> eval<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:env</span> eval <span style="color: #ae81ff;">.num</span>
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp2</span> <span style="color: #a6e22e;">:env</span> eval <span style="color: #ae81ff;">.num</span> sub num-val<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;var-exp&gt;</span>   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.var</span> <span style="color: #a6e22e;">:env</span> env-apply<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp&gt;</span>   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:env</span>
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.var</span>
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:env</span> eval
                 cons-env <span style="color: #fd971f;">:new-env!</span>
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.body</span> <span style="color: #a6e22e;">:new-env</span> eval<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org49cde3c" class="outline-2">
<h2 id="org49cde3c">parse</h2>
<div class="outline-text-2" id="text-org49cde3c">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #ae81ff;">123</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>
  <span style="color: #696969;">(</span>zero? <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span>
  <span style="color: #a6e22e;">:var</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;var-exp&gt;</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">let</span> <span style="color: #a6e22e;">:var</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp&gt;</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> parse <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:sexp</span> <span style="color: #66d9ef; font-weight: bold;">--</span> exp<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> string?<span style="color: #797979;">]</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span>
      <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> int-string?<span style="color: #797979;">]</span>   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> string-&gt;int const-exp<span style="color: #797979;">]</span>
      <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> local-string?<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> var-exp<span style="color: #797979;">]</span>
      <span style="color: #66d9ef; font-weight: bold;">else</span> <span style="color: #797979;">[</span><span style="color: #e6db74;">"- parse fail"</span> p nl
            <span style="color: #e6db74;">"  can not parse string : "</span> p <span style="color: #a6e22e;">:sexp</span> p nl
            <span style="color: #f92672; font-weight: bold;">error</span><span style="color: #797979;">]</span><span style="color: #696969;">)</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> cons?<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> parse/cons<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">else</span>  <span style="color: #797979;">[</span><span style="color: #e6db74;">"- parse fail"</span> p nl
           <span style="color: #e6db74;">"  can not parse sexp : "</span> p
           <span style="color: #a6e22e;">:sexp</span> sexp-print nl
           <span style="color: #f92672; font-weight: bold;">error</span><span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> parse/cons <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:sexp</span> <span style="color: #66d9ef; font-weight: bold;">--</span> exp<span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:sexp</span> <span style="color: #ae81ff;">.car</span> <span style="color: #fd971f;">:key!</span>
  <span style="color: #a6e22e;">:sexp</span> <span style="color: #ae81ff;">.cdr</span> <span style="color: #fd971f;">:body!</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'zero? eq?<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> parse/spread zero?-exp<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'if eq?<span style="color: #797979;">]</span>    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> parse/spread if-exp<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'diff eq?<span style="color: #797979;">]</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> parse/spread diff-exp<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'let eq?<span style="color: #797979;">]</span>   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> <span style="color: #ae81ff;">.car</span> <span style="color: #a6e22e;">:body</span>
                           <span style="color: #ae81ff;">.cdr</span> parse/spread let-exp<span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> parse/spread <span style="color: #B380A8;">{</span>parse<span style="color: #B380A8;">}</span> list-map list-spread<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
